app/views/shares/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---
		  <% else %>
		  <% user = User.find_by(id: share.owner) %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
          cost: <%= share.cost %> <br>
		  <% user = User.find_by(id: share.owner) %>